schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
// CAN bus health counters
uint32_t    g_frames_rx      = 0;   // total frames received
uint32_t    g_frames_decoded = 0;   // frames matching a known PGN/source
uint32_t    g_last_frame_ms  = 0;   // millis() at last received frame
uint32_t    g_last_http_ms   = 0;   // millis() at last served HTTP request (defers quiet sleep)
uint32_t    g_can_recoveries = 0;   // bus-off recoveries initiated since boot
uint32_t    g_socketcand_tx_dropped = 0;   // frames dropped on full client TCP buffers
bool        g_can_initialized = false;
bool        g_ap_running      = false;

// STA join telemetry for /config. Written by the WiFi event callback, which
// runs on the system event task rather than the loop task — hence volatile
// single-word values (torn reads aren't possible at word width or below).
volatile uint32_t g_sta_disconnects = 0;
volatile uint8_t  g_sta_last_disconnect_reason = 0;   // 0 = never disconnected

#if defined(HAS_MCP2515)
bool        g_mcp_initialized = false;
uint32_t    g_mcp_init_err    = 0xFFFFFFFFUL;   // sentinel: never attempted
uint32_t    g_mcp_frames_rx   = 0;
// MCP2515: external classic-CAN 2.0B controller wired to SPI, run at 250 kbit/s
// to match the J1939 main bus. The library's RX buffers are drained from
// loop(); frames are forwarded to socketcand as channel can1. Crystal frequency
// is board-dependent — see MCP2515_QUARTZ_HZ if can1 stays silent.
static ACAN2515 g_mcp(MCP2515_CS_PIN, SPI, MCP2515_INT_PIN);
#endif

#if defined(HAS_VIN_SENSE)
float       g_vin_v = NAN;   // most recent 12 V supply reading, averaged
#endif

#if defined(AUTOSHUTDOWN)
esp_sleep_wakeup_cause_t g_wake_cause = ESP_SLEEP_WAKEUP_UNDEFINED;   // set once in setup()
#endif

// Session energy tracking (integrated power since boot)
uint32_t    g_session_last_ms   = 0;
uint32_t    g_session_active_ms = 0;   // sum of valid dt's — excludes bus-silent gaps
float       g_session_wh_drawn  = 0.0f;
float       g_session_wh_charged = 0.0f;
// First BMS-published SOC seen this session; current - start = session ΔSOC.
float       g_session_soc_start_pct = NAN;

WebServer server(80);
DNSServer  dns_server;

// Dashboard HTML, embedded at build time via board_build.embed_txtfiles in
// platformio.ini. The linker generates these symbols from the file path:
// src/dashboard.html → _binary_src_dashboard_html_{start,end}. The data is
// null-terminated (embed_txtfiles), so the start pointer is usable as a
// C-string for server.send_P().
extern const uint8_t dashboard_html_start[] asm("_binary_src_dashboard_html_start");
extern const uint8_t dashboard_html_end[]   asm("_binary_src_dashboard_html_end");

// ── SD-card session logging (RejsaCAN) ──────────────────────────────────────────
// Records two streams to the onboard microSD whenever a card is present at boot:
//
//   /sNNNNN/can_PP.asc    every received CAN frame, Vector ASCII — replayable by
//                         solecan-analyze.py / solecan-stream.py --replay unchanged
//   /sNNNNN/data_PP.jsonl one buildJson() snapshot per line at SD_JSON_HZ (default 1)
//
// Design (see also the plan): loop() (core 1) only *formats* bytes and pushes them
// into two PSRAM ring buffers; a dedicated writer task (core 0) does every SD I/O.
// This keeps the decoded-state globals single-threaded — buildJson() and the .asc
// formatter both run on the loop task, and only opaque bytes cross to the writer —
// and it keeps SD stalls (block erase) off the CAN drain: a full ring drops whole
// lines (counted) rather than blocking loop(). Mid-session SD failures are
// handled by remount-and-resume (see sdRecoverOrFail); only repeated back-to-back
// failures latch "error" until reboot. No hot-insert: the card is probed once at
// boot; if it isn't there, the whole feature stays dormant (reboot to use a card
// inserted later).
#if defined(HAS_SD)

// ── Tunables ──
#ifndef SD_JSON_HZ
#define SD_JSON_HZ          1                         // decoded-snapshot cadence
#endif
#define SD_MAX_PART_BYTES   (64ULL * 1024 * 1024)     // roll raw/json parts at this size
#define SD_MIN_FREE_BYTES   (512ULL * 1024 * 1024)    // reap oldest sessions below this
#define SD_FLUSH_MS         1000                      // fsync cadence → ≤~1 s lost on power cut
#define SD_RAW_RING_BYTES   (1024UL * 1024)           // PSRAM ring for raw .asc
#define SD_JSON_RING_BYTES  (256UL * 1024)            // PSRAM ring for json lines
#define SD_FREE_CHECK_MS    10000                     // usedBytes() is slow — poll sparingly
#define SD_RECOVER_ATTEMPTS 5                         // remount tries before latching error
#define SD_RECOVER_DELAY_MS 250                       // backoff base between remount tries
#define SD_WRITE_CHUNK_BYTES 8192                     // batch writes into bursts this size

struct SdState {
    const char* state = "no_card";     // no_card | logging | error
    uint32_t          session   = 0;
    volatile uint32_t kb_written = 0;  // writer task (core 0) owns these two
    volatile uint32_t free_mb    = 0;
    const char*       fail_op  = "";     // which SD call failed (state == "error")
    volatile uint32_t fail_kb  = 0;      // KB written when it failed
    volatile uint32_t recoveries = 0;    // successful remount-and-resume cycles
};
static SdState g_sd;

// Set true once at boot after a successful mount + first session open; gates the
// producer in loop(). Only ever cleared again (mid-session card failure), never
// re-armed until reboot. Cross-core rule for this flag and the status fields in
// SdState/SdStream: every field has exactly one writer, and readers (buildJson)
// tolerate a torn multi-field snapshot — no control flow crosses the core
// boundary except this flag; the writer task otherwise sees nothing but bytes
// in the ring buffers.
volatile bool g_sd_active = false;

// Serializes every SD/SPI touch between the writer task (core 0) and the
// /sd/* HTTP handlers (loop task, core 1). The writer holds it per
// drain/flush/roll burst; HTTP holds it per operation — and per read chunk
// while streaming a tar — so a download stalls logging only briefly and the
// PSRAM rings absorb it. sdFail() must release it before self-deleting.
static SemaphoreHandle_t g_sd_mutex = nullptr;

// Session id currently being streamed as a tar by handleSdSessionGet (0 = none;
// session numbering starts at 1). The free-space reaper (sdScanSessions)
// excludes it so it can never SD.remove() a file of a session an HTTP client has
// open mid-download — illegal under FatFs FS_LOCK=0 and a volume-corruption
// risk. Set/cleared only on the loop task; volatile because the writer task
// reads it under the mutex.
static volatile uint32_t g_sd_http_stream_session = 0;

struct SdLock {
    SdLock()  { xSemaphoreTake(g_sd_mutex, portMAX_DELAY); }
    ~SdLock() { xSemaphoreGive(g_sd_mutex); }
};

