schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
// Drain one stream: pull a chunk from its ring and write it. Batch: drain only
// once a full chunk is waiting, or when the flush deadline arrives (so trickle
// data still lands within ~1 s). Short write bursts leave the card idle between
// them, instead of the continuous 512-byte-at-a-time program cycle that
// provoked mid-write card lockups. If a write fails, the chunk is still in buf
// after the remount, so the retry re-lands it — no data lost.
static bool sdDrainStream(SdStream& s, bool flush_due, uint8_t* buf) {
    if (!flush_due && xStreamBufferBytesAvailable(s.sb) < SD_WRITE_CHUNK_BYTES)
        return false;
    size_t n = xStreamBufferReceive(s.sb, buf, SD_WRITE_CHUNK_BYTES, 0);
    if (!n) return false;
    if (s.file.write(buf, n) != n) {
        sdRecoverOrFail(s.write_op);
        if (s.file.write(buf, n) != n) sdFail(s.write_op);
    }
    s.part_bytes += n;
    sd_total_bytes += n;
    return true;
}

// Roll to the next part once the current one reaches SD_MAX_PART_BYTES, so no
// single file grows unbounded.
static void sdRollIfDue(SdStream& s) {
    if (s.part_bytes < SD_MAX_PART_BYTES) return;
    s.file.flush();
    s.file.close();
    s.part++;
    if (!sdOpenPart(s)) sdRecoverOrFail(s.open_op);
}

static void sdWriterTask(void*) {
    static uint8_t buf[SD_WRITE_CHUNK_BYTES];   // static — doesn't fit the task stack
    uint32_t last_flush = millis();
    uint32_t last_free  = millis() - SD_FREE_CHECK_MS;   // check on first idle

    for (;;) {
        bool flush_due = (millis() - last_flush >= SD_FLUSH_MS);

        xSemaphoreTake(g_sd_mutex, portMAX_DELAY);
        bool did = sdDrainStream(g_sd_raw, flush_due, buf);
        did     |= sdDrainStream(g_sd_json, flush_due, buf);
        g_sd.kb_written = (uint32_t)(sd_total_bytes >> 10);

        sdRollIfDue(g_sd_raw);
        sdRollIfDue(g_sd_json);

        if (flush_due) {
            last_flush = millis();
            g_sd_raw.file.flush();
            g_sd_json.file.flush();
        }
        if (millis() - last_free >= SD_FREE_CHECK_MS) {
            last_free = millis();
            sdUpdateFree();
        }
        xSemaphoreGive(g_sd_mutex);

        if (!did) vTaskDelay(pdMS_TO_TICKS(20));   // both rings empty — yield
    }
}

static bool sdInitRing(SdStream& s) {
    s.storage = (uint8_t*) heap_caps_malloc(s.ring_bytes + 1, MALLOC_CAP_SPIRAM);
    if (!s.storage) return false;
    s.sb = xStreamBufferCreateStatic(s.ring_bytes, 1, s.storage, &s.sb_struct);
    return s.sb != nullptr;
}

// Probe the card once and, only on success, start logging + spawn the writer.
// Called from setup(); leaves the feature dormant (g_sd_active stays false) on
// any failure so the firmware behaves exactly as a card-less tap. Boot failures
// latch state="error" with a fail_op right here — sdFail() self-deletes the
// calling task, so it must never run on the setup/loop task.
static void sdInit() {
    g_sd_mutex = xSemaphoreCreateMutex();
    if (!g_sd_mutex || !sdInitRing(g_sd_raw) || !sdInitRing(g_sd_json)) {
        g_sd.fail_op = "ring_alloc";
        g_sd.state   = "error";
        return;
    }

    SPI.begin(SD_SCK_PIN, SD_MISO_PIN, SD_MOSI_PIN, SD_CS_PIN);
    if (!SD.begin(SD_CS_PIN)) { g_sd.state = "no_card"; return; }
    if (!sdStartSession()) {
        g_sd.fail_op = "start_session";
        g_sd.state   = "error";
        SD.end();
        return;
    }

    g_sd.state = "logging";
    xTaskCreatePinnedToCore(sdWriterTask, "sdwriter", 8192, nullptr, 1, nullptr, 0);
    g_sd_active = true;   // arm the producer last, once everything is ready
}

#endif  // HAS_SD

// ── LED status indicator ──────────────────────────────────────────────────────
// Single-LED boards (Adafruit Feather S3 NeoPixel) colour-code state on one
// pixel:
//   Red blink     — CAN driver failed to initialize
//   Amber blink   — No Wi-Fi up at all (AP failed and STA not connected)
//   Dim white     — Alive, no CAN frames received recently
//   Green blink   — CAN frames arriving (toggles on bus activity)
//
// Dual-LED boards (RejsaCAN-ESP32-S3) split the state across two pins:
//   Yellow fast blink — CAN driver failed to initialize
//   Yellow slow blink — No Wi-Fi
//   Yellow off        — Network OK
//   Blue blink        — CAN frames arriving
//   Blue off          — No frames recently (green power LED still shows alive)
//
// On boards without any user LED (LilyGo T-2CAN), the calls are no-ops.

#define LED_BLINK_MS         50
#define LED_ACTIVE_MS        200
#define WARN_BLINK_FAST_MS   100   // CAN init failed
#define WARN_BLINK_SLOW_MS   500   // no WiFi

static uint32_t g_led_last_toggle = 0;
static bool     g_led_on = false;

static inline void ledInit() {
#if LED_IS_NEOPIXEL
    pinMode(LED_POWER_PIN, OUTPUT);
    digitalWrite(LED_POWER_PIN, HIGH);   // enable NeoPixel power rail
#elif LED_IS_DUAL_GPIO
    pinMode(WARN_LED_PIN, OUTPUT);
    pinMode(ACTIVITY_LED_PIN, OUTPUT);
    digitalWrite(WARN_LED_PIN, LOW);
    digitalWrite(ACTIVITY_LED_PIN, LOW);
#endif
}

static inline void ledWrite(uint8_t r, uint8_t g, uint8_t b) {
#if LED_IS_NEOPIXEL
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    rgbLedWrite(LED_PIN, r, g, b);
  #else
    neopixelWrite(LED_PIN, r, g, b);
  #endif
#else
    // Dual-GPIO and no-LED boards: updateLed() drives the pins directly (dual)
    // or there's nothing to drive (none).
    (void)r; (void)g; (void)b;
#endif
}

void updateLed() {
#if LED_IS_DUAL_GPIO
    uint32_t now = millis();

    // Yellow warning channel. Off when healthy; periods chosen so the two
    // failure modes are distinguishable at a glance.
    uint32_t warn_period_ms = 0;
    if (!g_can_initialized) {
        warn_period_ms = WARN_BLINK_FAST_MS;
    } else if (!g_ap_running && WiFi.status() != WL_CONNECTED) {
        warn_period_ms = WARN_BLINK_SLOW_MS;
    }
    static uint32_t warn_last_toggle = 0;
    static bool     warn_on = false;
    if (warn_period_ms > 0) {
        if (now - warn_last_toggle >= warn_period_ms) {
            warn_last_toggle = now;
            warn_on = !warn_on;
        }
        digitalWrite(WARN_LED_PIN, warn_on ? HIGH : LOW);
    } else {
        digitalWrite(WARN_LED_PIN, LOW);
        warn_on = false;
    }

    // Blue activity channel. The board's green power LED already signals
    // "alive", so blue stays off until bus traffic appears.
    bool active = (g_frames_rx > 0) && (now - g_last_frame_ms < LED_ACTIVE_MS);
    static uint32_t act_last_toggle = 0;
    static bool     act_on = false;
    if (active) {
        if (now - act_last_toggle >= LED_BLINK_MS) {
            act_last_toggle = now;
            act_on = !act_on;
        }
        digitalWrite(ACTIVITY_LED_PIN, act_on ? HIGH : LOW);
    } else {
        digitalWrite(ACTIVITY_LED_PIN, LOW);
        act_on = false;
    }
    return;
#else
    uint32_t now = millis();
    bool toggle = (now - g_led_last_toggle) >= LED_BLINK_MS;

