schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
    if (!g_can_initialized) {
        if (toggle) { g_led_last_toggle = now; g_led_on = !g_led_on; }
        ledWrite(g_led_on ? 32 : 0, 0, 0);
        return;
    }
    if (!g_ap_running && WiFi.status() != WL_CONNECTED) {
        if (toggle) { g_led_last_toggle = now; g_led_on = !g_led_on; }
        ledWrite(g_led_on ? 24 : 0, g_led_on ? 12 : 0, 0);
        return;
    }
    bool active = (g_frames_rx > 0) && (now - g_last_frame_ms < LED_ACTIVE_MS);
    if (!active) {
        ledWrite(4, 4, 4);
        g_led_on = false;
        g_led_last_toggle = now;
        return;
    }
    if (toggle) {
        g_led_last_toggle = now;
        g_led_on = !g_led_on;
    }
    ledWrite(0, g_led_on ? 32 : 0, 0);
#endif
}

#if defined(HAS_VIN_SENSE)
// Sample the 12 V input rail every ~500 ms. analogReadMilliVolts() applies
// the ADC's eFuse calibration; we oversample 16× to knock the LSB noise down.
// The divider scales the pin reading back up to the actual VCC.
static void updateVinSense() {
    static uint32_t last_ms = 0;
    uint32_t now = millis();
    if (now - last_ms < 500) return;
    last_ms = now;
    uint32_t sum_mv = 0;
    for (int i = 0; i < 16; i++) sum_mv += analogReadMilliVolts(VIN_SENSE_PIN);
    float pin_mv = sum_mv / 16.0f;
    g_vin_v = (pin_mv * VIN_DIVIDER_NUM / VIN_DIVIDER_DEN) / 1000.0f;
}
#endif

// ── CAN bus-off recovery ──────────────────────────────────────────────────────
// Sustained bus errors (shorted wiring, bitrate mismatch while transmitting)
// drive the TWAI controller bus-off, where it stays until software intervenes
// — without this, capture is dead until a power cycle. Poll the driver state
// and walk it back: BUS_OFF → initiate recovery (the controller waits out
// 128×11 recessive bits), which completes into STOPPED → start again.
//
// The MCP2515 (can1) deliberately has no equivalent: bus-off is driven by the
// *transmit* error counter, so a listen-only controller can never reach it,
// and in a -DCAN_ALLOW_TX build the MCP2515 — unlike the TWAI peripheral —
// recovers from bus-off automatically in hardware. Its error state is
// observable via tec/rec/eflg in the /json mcp2515 block.

static void canRecoveryTick() {
    static uint32_t last_ms = 0;
    uint32_t now = millis();
    if (!g_can_initialized || now - last_ms < 1000) return;
    last_ms = now;
    twai_status_info_t si;
    if (twai_get_status_info(&si) != ESP_OK) return;
    if (si.state == TWAI_STATE_BUS_OFF) {
        if (twai_initiate_recovery() == ESP_OK) g_can_recoveries++;
    } else if (si.state == TWAI_STATE_STOPPED) {
        twai_start();
    }
}

#if defined(AUTOSHUTDOWN)
// ── Energy-saving deep sleep ──────────────────────────────────────────────────
// A parked tractor (or bench setup) produces no CAN traffic, so there's
// nothing to log. Deep sleep + wake-on-CAN needs nothing board-specific: any
// board's CAN_RX_PIN can be an ext0 wake source (0–21 are RTC-capable on the
// S3, and every board map here picks one in that range).
//
// Wake source is CAN traffic only (ext0 on CAN_RX: the first dominant bit
// pulls the line low). There is deliberately no voltage-rise wake: on the
// RejsaCAN, the tractor's measured 12 V rail is ~12.4 V key-off / ~12.7 V
// key-on (issue #41 comments), both below the comparator's assumed on/off
// thresholds (~13.0/13.7 V for the genuine R4=91k board), so SENSE_V_DIG would
// not reliably fire even at key-on, let alone during a charge session. CAN
// wake covers both cases: ECUs broadcast at key-on, and the charger/BMS
// broadcast during charging.
//
// TENTATIVE: assumes gpio_hold_en() holds a non-RTC digital output through
// deep sleep on the S3, and that ext0 wakes with the transceiver left in
// normal mode (RS held LOW, not standby) — neither is bench-verified yet.
#define CAN_QUIET_SLEEP_MS   (10UL * 60UL * 1000UL)   // 10 min of silence

static void checkCanQuietSleep() {
    uint32_t now = millis();
    if (now - g_last_frame_ms < CAN_QUIET_SLEEP_MS) return;
    // A live web client defers sleep too: pulling files off the card over WiFi
    // is exactly the parked-tractor case, and CAN is silent then, so without
    // this the board would sleep out from under a download. handleNotFound is
    // excluded (see noteHttpActivity), so idle captive-portal probes don't pin
    // it awake.
    if (now - g_last_http_ms < CAN_QUIET_SLEEP_MS) return;

    WiFi.mode(WIFI_OFF);
    BLEDevice::deinit(true);
    twai_stop();
    twai_driver_uninstall();

#if defined(BOARD_REJSACAN)
    // RejsaCAN-only: these pins are firmware-driven and float during deep
    // sleep unless held, which would cause real problems on this board —
    // CAN_RS floating drops the transceiver into slope-control mode (mangles
    // frames, including the one meant to wake us) and FORCE_ON floating risks
    // a spurious auto-shutdown edge. The other boards don't define these pins
    // (transceiver mode is fixed in hardware, no auto-shutdown circuit), so
    // there's nothing to hold there.
    digitalWrite(WARN_LED_PIN, LOW);
    digitalWrite(ACTIVITY_LED_PIN, LOW);
    gpio_hold_en(CAN_RS_PIN);
    gpio_hold_en(FORCE_ON_PIN);
    gpio_hold_en(WARN_LED_PIN);
    gpio_hold_en(ACTIVITY_LED_PIN);
    gpio_deep_sleep_hold_en();
#endif

    esp_sleep_enable_ext0_wakeup(CAN_RX_PIN, 0 /*wake when pulled LOW*/);
    esp_deep_sleep_start();
    // Never returns — waking from deep sleep is a full reboot back into setup().
}
#endif

// ── Helpers ───────────────────────────────────────────────────────────────────

static inline uint16_t be16(uint8_t hi, uint8_t lo) {
    return ((uint16_t)hi << 8) | lo;
}

static inline uint16_t le16(uint8_t lo, uint8_t hi) {
    return ((uint16_t)hi << 8) | lo;
}

static bool allZero(const uint8_t* d) {
    for (int i = 0; i < 8; i++) if (d[i]) return false;
    return true;
}

// ── CAN decoder ───────────────────────────────────────────────────────────────

void decodeCAN(uint32_t can_id, const uint8_t* raw, uint8_t len) {
    uint8_t d[8] = {};
    memcpy(d, raw, len < 8 ? len : 8);

    uint8_t  src = can_id & 0xFF;
    uint8_t  pf  = (can_id >> 16) & 0xFF;
    uint8_t  ps  = (can_id >> 8)  & 0xFF;
    uint16_t pgn = ((uint16_t)pf << 8) | (pf >= 0xF0 ? ps : 0);

    // Count any frame from a known source as decoded, before the per-PGN
    // decoders below — they often early-return on all-zero idle frames.
    if (src == SRC_BMS || src == SRC_BMS_CHGR_IF || src == SRC_CHARGER ||
        src == SRC_VEHICLE || src == SRC_MOTOR || src == SRC_DASH)
        g_frames_decoded++;

