schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
// ── HTTP handlers ─────────────────────────────────────────────────────────────

// Marks a served request so an active web client (dashboard poller, file
// download) defers the CAN-quiet deep sleep — see checkCanQuietSleep(). Called
// at the top of every real endpoint but deliberately NOT from handleNotFound:
// an idle phone joined to the AP fires captive-portal probes at unknown paths,
// and counting those would keep the board awake forever.
static inline void noteHttpActivity() { g_last_http_ms = millis(); }

void handleJson() {
    noteHttpActivity();
    server.send(200, "application/json", buildJson());
}

// Names for the STA disconnect reasons that come up when a credentials build
// goes wrong: auth_fail / handshake_timeout usually mean a wrong password,
// no_ap_found a wrong SSID or out-of-range network. Rare codes stay numeric.
static String staDisconnectReasonName(uint8_t reason) {
    switch (reason) {
        case WIFI_REASON_UNSPECIFIED:                return "unspecified";
        case WIFI_REASON_AUTH_EXPIRE:                return "auth_expire";
        case WIFI_REASON_AUTH_LEAVE:                 return "auth_leave";
        case WIFI_REASON_ASSOC_EXPIRE:               return "assoc_expire";
        case WIFI_REASON_ASSOC_TOOMANY:              return "assoc_toomany";
        case WIFI_REASON_NOT_AUTHED:                 return "not_authed";
        case WIFI_REASON_NOT_ASSOCED:                return "not_assoced";
        case WIFI_REASON_ASSOC_LEAVE:                return "assoc_leave";
        case WIFI_REASON_MIC_FAILURE:                return "mic_failure";
        case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:     return "4way_handshake_timeout";
        case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT:   return "group_key_update_timeout";
        case WIFI_REASON_802_1X_AUTH_FAILED:         return "802_1x_auth_failed";
        case WIFI_REASON_BEACON_TIMEOUT:             return "beacon_timeout";
        case WIFI_REASON_NO_AP_FOUND:                return "no_ap_found";
        case WIFI_REASON_AUTH_FAIL:                  return "auth_fail";
        case WIFI_REASON_ASSOC_FAIL:                 return "assoc_fail";
        case WIFI_REASON_HANDSHAKE_TIMEOUT:          return "handshake_timeout";
        case WIFI_REASON_CONNECTION_FAIL:            return "connection_fail";
        case WIFI_REASON_AP_TSF_RESET:               return "ap_tsf_reset";
        case WIFI_REASON_ROAMING:                    return "roaming";
        default:                                     return String(reason);
    }
}

// Build + WiFi diagnostics, deliberately separate from the /json telemetry:
// this reports what was baked into the binary and how the home-network join
// is going. The soft-AP is always up, so /config stays reachable at
// 192.168.4.1 even when the STA join failed — one request distinguishes
// "wrong password" from "wrong SSID" from "built with empty credentials".
void handleConfig() {
    noteHttpActivity();
    JsonDocument doc;

    doc["uptime"] = millis() / 1000.0;
#ifdef GIT_SHA
    doc["version"] = GIT_SHA;
#endif
#if defined(BOARD_ADAFRUIT_FEATHER_S3)
    doc["board"] = "adafruit_feather_s3";
#elif defined(BOARD_LILYGO_T2CAN)
    doc["board"] = "lilygo_t2can";
#elif defined(BOARD_REJSACAN)
    doc["board"] = "rejsacan";
#endif
    doc["mdns"] = MDNS_NAME;

    auto features = doc["features"].to<JsonObject>();
    features["can_tx"]    = (bool)CAN_TX_ENABLED;
#if defined(HAS_MCP2515)
    features["mcp2515"]   = true;
#else
    features["mcp2515"]   = false;
#endif
#if defined(HAS_VIN_SENSE)
    features["vin_sense"] = true;
#else
    features["vin_sense"] = false;
#endif

    auto wifi = doc["wifi"].to<JsonObject>();

    auto sta = wifi["sta"].to<JsonObject>();
    const bool join_sta = (sizeof(WIFI_SSID) > 1);
    sta["ssid"]     = WIFI_SSID;                    // exactly what was compiled in
    sta["pass_set"] = (sizeof(WIFI_PASS) > 1);      // presence only, never the password
    sta["enabled"]  = join_sta;
    const bool sta_connected = join_sta && WiFi.status() == WL_CONNECTED;
    sta["status"] = !join_sta ? "disabled"
                  : sta_connected ? "connected" : "connecting";
    if (sta_connected) {
        sta["ip"]   = WiFi.localIP().toString();
        sta["rssi"] = WiFi.RSSI();
    }
    sta["disconnects"] = (uint32_t)g_sta_disconnects;
    if (g_sta_disconnects > 0)
        sta["last_disconnect_reason"] =
            staDisconnectReasonName(g_sta_last_disconnect_reason);

    auto ap = wifi["ap"].to<JsonObject>();
    ap["ssid"]    = AP_SSID;
    ap["running"] = g_ap_running;
    if (g_ap_running) {
        ap["ip"]      = WiFi.softAPIP().toString();
        ap["clients"] = WiFi.softAPgetStationNum();
    }

    String out;
    serializeJsonPretty(doc, out);
    server.send(200, "application/json", out);
}

void handleRoot() {
    noteHttpActivity();
    // HTML lives in src/dashboard.html; embedded via board_build.embed_txtfiles.
    // Length excludes the trailing null byte that embed_txtfiles appends.
    size_t len = dashboard_html_end - dashboard_html_start - 1;
    server.send_P(200, "text/html", (PGM_P)dashboard_html_start, len);
}

#if defined(HAS_SD)
// ── SD file access API ────────────────────────────────────────────────────────
// See docs/superpowers/specs/2026-07-18-sd-file-api-design.md. /sd/status is
// in-RAM only (poll freely); /sd/list, /sd/session/{id} GET (tar) and DELETE
// touch the card under g_sd_mutex and answer 503 unless a session is logging.

// Minimal built-in browser UI at /sd: shows /sd/status and the /sd/list
// sessions, each with a download link (its tar). Self-contained — no embedded
// asset, no external resources — so it costs only this string in flash. It
// fetches the two JSON endpoints once on load (Refresh re-fetches); it does not
// poll, so an open tab won't keep the board awake past the download.
static const char SD_INDEX_HTML[] PROGMEM = R"HTML(<!doctype html>
<meta charset=utf-8>
<meta name=viewport content="width=device-width,initial-scale=1">
<title>SD sessions</title>
<style>
 body{font:14px/1.5 system-ui,sans-serif;margin:1rem;max-width:760px}
 h1{font-size:1.1rem}
 #status{margin:.5rem 0;padding:.5rem .7rem;border:1px solid #ccc;border-radius:6px}
 table{border-collapse:collapse;width:100%}
 th,td{text-align:left;padding:.35rem .5rem;border-bottom:1px solid #ddd}
 td.num,th.num{text-align:right;font-variant-numeric:tabular-nums}
 .muted{color:#777}
 button{font:inherit;padding:.2rem .7rem}
 @media (prefers-color-scheme:dark){
  body{background:#111;color:#ddd}#status{border-color:#444}
  th,td{border-color:#333}a{color:#6bf}}
</style>
<h1>SD sessions</h1>
<div id=status class=muted>Loading&hellip;</div>
<p><button onclick=load()>Refresh</button> <span id=err class=muted></span></p>
<table><thead><tr><th>Session<th class=num>Files<th class=num>Size<th>Download</thead>
<tbody id=rows></tbody></table>
<script>
function mb(kb){return((kb||0)/1024).toFixed(1)+' MB'}
function human(b){if(b==null)return'';var u=['B','KB','MB','GB'],i=0;b=+b;
 while(b>=1024&&i<u.length-1){b/=1024;i++}return b.toFixed(i?1:0)+' '+u[i]}
function pad(n){return 's'+String(n).padStart(5,'0')}
async function jget(u){var r=await fetch(u);if(!r.ok)throw Error(u+' → '+r.status);return r.json()}
async function loadStatus(){var el=document.getElementById('status');
 try{var s=await jget('/sd/status'),t=s.state;
  if(s.state==='logging')t='logging '+pad(s.session)+' · '+mb(s.kb_written)+
   ' written · '+human((s.free_mb||0)*1048576)+' free';
  el.textContent=t;el.className='';
 }catch(e){el.textContent='status: '+e.message;el.className='muted'}}
async function loadList(){var tb=document.getElementById('rows'),err=document.getElementById('err');
 try{var d=await jget('/sd/list');err.textContent='';
  tb.innerHTML=(d.sessions||[]).sort(function(a,b){return b.id-a.id}).map(function(s){
   return '<tr><td>'+pad(s.id)+(s.active?' <span class=muted>(active)</span>':'')+
    '<td class=num>'+((s.files||[]).length)+'<td class=num>'+human(s.bytes)+
    '<td><a href="/sd/session/'+s.id+'" download>'+pad(s.id)+'.tar</a>';
  }).join('')||'<tr><td colspan=4 class=muted>No sessions</td></tr>';
 }catch(e){err.textContent=e.message}}
function load(){loadStatus();loadList()}
load();
</script>
)HTML";

static void handleSdIndex() {
    noteHttpActivity();
    server.send_P(200, "text/html", SD_INDEX_HTML);
}

static void sdSendError(int code, const char* msg) {
    server.send(code, "application/json",
                String("{\"error\":\"") + msg + "\"}");
}

// Cheap logging status + the diagnostics that used to ride along in /json
// (raw_part, json_part, recoveries, fail_op, fail_kb). No mutex, no card I/O.
static void handleSdStatus() {
    noteHttpActivity();
    JsonDocument doc;
    doc["state"] = g_sd.state;
    if (g_sd_active) {
        doc["session"]    = g_sd.session;
        doc["raw_part"]   = g_sd_raw.part;
        doc["json_part"]  = g_sd_json.part;
        doc["kb_written"] = g_sd.kb_written;
        doc["free_mb"]    = g_sd.free_mb;
    }
    if (g_sd_raw.dropped)  doc["raw_dropped"]  = g_sd_raw.dropped;
    if (g_sd_json.dropped) doc["json_dropped"] = g_sd_json.dropped;
    if (g_sd.recoveries)   doc["recoveries"]   = g_sd.recoveries;
    if (g_sd.fail_op[0]) {
        doc["fail_op"] = g_sd.fail_op;
        doc["fail_kb"] = g_sd.fail_kb;
    }
    String out;
    serializeJsonPretty(doc, out);
    server.send(200, "application/json", out);
}

// Session/file inventory: one mutex-guarded walk of the card. Only /sNNNNN
// directories are listed (same sdParseSession() filter as the reaper).
static void handleSdList() {
    noteHttpActivity();
    if (!g_sd_active) { sdSendError(503, "sd_unavailable"); return; }
    JsonDocument doc;
    auto sessions = doc["sessions"].to<JsonArray>();
    bool open_ok = true;
    {
        SdLock lock;
        File root = SD.open("/");
        if (!root) { open_ok = false; }
        else {
        for (File e = root.openNextFile(); e; e = root.openNextFile()) {
            uint32_t n;
            if (e.isDirectory() && sdParseSession(sdBasename(e.name()), n)) {
                auto s = sessions.add<JsonObject>();
                s["id"]     = n;
                s["active"] = (n == g_sd.session);
                uint64_t total = 0;
                char path[16];
                snprintf(path, sizeof path, "/s%05lu", (unsigned long)n);
                auto files = s["files"].to<JsonArray>();
                File d = SD.open(path);
                if (d) {
                    for (File f = d.openNextFile(); f; f = d.openNextFile()) {
                        if (!f.isDirectory()) {
                            auto fo = files.add<JsonObject>();
                            fo["name"] = sdBasename(f.name());   // ArduinoJson 7 copies
                            fo["size"] = (uint32_t)f.size();
                            total += f.size();
                        }
                        f.close();
                    }
                    d.close();
                }
                s["bytes"] = total;
            }
            e.close();
        }
        root.close();
        }
    }
    if (!open_ok) { sdSendError(500, "open_root"); return; }
    String out;
    serializeJsonPretty(doc, out);
    server.send(200, "application/json", out);
}

// Minimal USTAR header for one regular file. `name` ("s00042/can_00.asc") is
// far below the 100-byte field. mtime is 0 — the ESP32 has no RTC, matching
// the nominal date in the .asc header.
static void tarFillHeader(uint8_t hdr[512], const char* name, uint32_t size) {
    memset(hdr, 0, 512);
    strncpy((char*)hdr, name, 99);                 // name
    memcpy(hdr + 100, "0000644", 8);               // mode
    memcpy(hdr + 108, "0000000", 8);               // uid
    memcpy(hdr + 116, "0000000", 8);               // gid
    char oct[13];
    snprintf(oct, sizeof oct, "%011lo", (unsigned long)size);
    memcpy(hdr + 124, oct, 12);                    // size
    memcpy(hdr + 136, "00000000000", 12);          // mtime
    hdr[156] = '0';                                // typeflag: regular file
    memcpy(hdr + 257, "ustar", 6);                 // magic (NUL-terminated)
    memcpy(hdr + 263, "00", 2);                    // version
    memset(hdr + 148, ' ', 8);                     // checksum: spaces while summing
    uint32_t sum = 0;
    for (int i = 0; i < 512; i++) sum += hdr[i];
    snprintf(oct, sizeof oct, "%06lo", (unsigned long)sum);
    memcpy(hdr + 148, oct, 6);
    hdr[154] = '\0';
    hdr[155] = ' ';
}

// Push `n` bytes to the client, tolerating partial writes. Bounded retries so
// a wedged socket can't hang the loop task forever.
static bool sdClientWrite(WiFiClient& client, const uint8_t* p, size_t n) {
    int stalls = 0;
    while (n) {
        if (!client.connected()) return false;
        size_t w = client.write(p, n);
        if (w == 0) {
            if (++stalls > 50) return false;
            delay(2);
            continue;
        }
        stalls = 0;
        p += w;
        n -= w;
    }
    return true;
}

