schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
// Parse the {id} path segment as a plain decimal session number.
// Returns false on empty/garbage (→ 404, matching a nonexistent session).
static bool sdParseIdArg(uint32_t& id) {
    String arg = server.pathArg(0);
    if (arg.isEmpty()) return false;
    char* end = nullptr;
    id = strtoul(arg.c_str(), &end, 10);
    return end && *end == '\0';
}

// Drain the CAN controllers and emit the periodic snapshot. Called from loop()
// and, per chunk, from the tar streamer so a multi-MB download never starves
// the sole CAN consumer.
static void canServiceTick();

// GET /sd/session/{id} — the whole session directory as one uncompressed
// USTAR stream. Member sizes freeze at header time (the walk below), so the
// active session yields a consistent snapshot ≤~1 s stale. If a member reads
// short of its frozen size (read error / file gone), the stream is truncated
// and the socket closed, so the client detects a short read against
// Content-Length rather than receiving a byte-perfect zero-filled file. The
// mutex is held per chunk, never across client I/O. g_sd_http_stream_session is
// set for the whole handler so the reaper cannot delete the session mid-stream.
static void handleSdSessionGet() {
    noteHttpActivity();
    if (!g_sd_active) { sdSendError(503, "sd_unavailable"); return; }
    uint32_t id;
    if (!sdParseIdArg(id)) { sdSendError(404, "not_found"); return; }

    char dir[16];
    snprintf(dir, sizeof dir, "/s%05lu", (unsigned long)id);

    SdStreamGuard stream_guard(id);   // clears g_sd_http_stream_session on any return

    struct Member { String name; uint32_t size; };
    std::vector<Member> members;
    {
        SdLock lock;
        File d = SD.open(dir);
        if (!d || !d.isDirectory()) {
            if (d) d.close();
            sdSendError(404, "not_found");
            return;
        }
        for (File f = d.openNextFile(); f; f = d.openNextFile()) {
            if (!f.isDirectory())
                members.push_back({ String(sdBasename(f.name())),
                                    (uint32_t)f.size() });
            f.close();
        }
        d.close();
    }

    uint64_t total = 1024;   // end-of-archive: two zero blocks
    for (auto& m : members)
        total += 512 + (((uint64_t)m.size + 511) / 512) * 512;
    if (total > UINT32_MAX) { sdSendError(507, "too_large"); return; }

    server.setContentLength((size_t)total);
    server.sendHeader("Content-Disposition",
                      String("attachment; filename=") + (dir + 1) + ".tar");
    server.send(200, "application/x-tar", "");
    WiFiClient client = server.client();

    static uint8_t buf[4096];   // loop-task stack is tight; single-threaded handler
    for (auto& m : members) {
        char arcname[48], path[48];
        snprintf(arcname, sizeof arcname, "%s/%s", dir + 1, m.name.c_str());
        snprintf(path,    sizeof path,    "%s/%s", dir,     m.name.c_str());
        uint8_t hdr[512];
        tarFillHeader(hdr, arcname, m.size);
        if (!sdClientWrite(client, hdr, 512)) return;

        File f;
        { SdLock lock; f = SD.open(path, FILE_READ); }
        uint32_t sent = 0;
        while (sent < m.size) {
            size_t want = m.size - sent;
            if (want > sizeof buf) want = sizeof buf;
            int n;
            { SdLock lock; n = f ? f.read(buf, want) : -1; }
            if (n <= 0) {                          // read error / file gone mid-stream:
                { SdLock lock; if (f) f.close(); } // truncate rather than zero-pad so
                client.stop();                     // the client sees a short read vs
                return;                            // Content-Length
            }
            if (!sdClientWrite(client, buf, n)) {
                SdLock lock; if (f) f.close();
                return;                                       // client went away
            }
            sent += n;
            canServiceTick();    // keep draining CAN between chunks; not under SdLock
            noteHttpActivity();  // a multi-minute download keeps deferring quiet sleep
        }
        { SdLock lock; if (f) f.close(); }

        size_t pad = (512 - (m.size % 512)) % 512;
        if (pad) {
            memset(buf, 0, pad);
            if (!sdClientWrite(client, buf, pad)) return;
        }
    }
    memset(buf, 0, 1024);
    sdClientWrite(client, buf, 1024);   // end-of-archive trailer
}

// DELETE /sd/session/{id} — recursively remove a session directory via the
// reaper's helper. The active session is never deletable. free_mb is
// recomputed here (usedBytes() is slow, but deletes are rare) so the response
// reflects the space just reclaimed.
static void handleSdSessionDelete() {
    noteHttpActivity();
    if (!g_sd_active) { sdSendError(503, "sd_unavailable"); return; }
    uint32_t id;
    if (!sdParseIdArg(id)) { sdSendError(404, "not_found"); return; }
    if (id == g_sd.session) { sdSendError(409, "active_session"); return; }
    // Cannot race on the single-threaded WebServer, but refuse deleting a
    // session an HTTP client is streaming — one line, future-proof.
    if (id == g_sd_http_stream_session) { sdSendError(409, "streaming"); return; }

    char dir[16];
    snprintf(dir, sizeof dir, "/s%05lu", (unsigned long)id);

    enum Result { OK, NOT_FOUND, REMOVE_FAILED } result = OK;
    uint32_t free_mb = 0;
    {
        SdLock lock;
        File d = SD.open(dir);
        if (!d || !d.isDirectory()) {
            if (d) d.close();
            result = NOT_FOUND;
        } else {
            d.close();
            if (!sdRemoveSessionDir(dir)) {
                result = REMOVE_FAILED;
            } else {
                uint64_t total = SD.totalBytes();
                uint64_t used  = SD.usedBytes();
                g_sd.free_mb = (uint32_t)((total > used ? total - used : 0) >> 20);
                free_mb = g_sd.free_mb;
            }
        }
    }
    if (result == NOT_FOUND)     { sdSendError(404, "not_found");     return; }
    if (result == REMOVE_FAILED) { sdSendError(500, "remove_failed"); return; }
    server.send(200, "application/json",
                String("{\"free_mb\":") + free_mb + "}");
}
#endif  // HAS_SD

