schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
void handleNotFound() {
    // The soft-AP's wildcard DNS lands every hostname here, including phone
    // connectivity probes (generate_204 / hotspot-detect.html). Answering
    // those with a redirect — not a 404 — makes the OS classify the AP as a
    // captive portal and auto-open the dashboard when someone joins.
    // localIP() is the board's address on whichever interface (AP or STA)
    // the request arrived on, so bench-network clients redirect sensibly too.
    server.sendHeader("Location",
                      "http://" + server.client().localIP().toString() + "/");
    server.send(302, "text/plain", "");
}

// ── SLCAN ─────────────────────────────────────────────────────────────────────
// Presents the CAN bus as an SLCAN device over USB CDC serial.
// python-can: interface='slcan', channel='/dev/cu.usbmodem...'
// Receive always works; transmit (t/T commands) is gated on -DCAN_ALLOW_TX and
// routes to can0 (the native TWAI controller) only — SLCAN has no channel
// concept, so it never reaches the MCP2515 (can1). A listen-only build answers
// every t/T with BELL.

static char   slcan_buf[32];
static uint8_t slcan_len = 0;
static bool   slcan_open = false;

void slcanSendFrame(const twai_message_t& msg) {
    if (!slcan_open) return;
    char line[32];
    // 'T' + 8 hex ID digits for 29-bit frames, 't' + 3 for 11-bit.
    int n = msg.extd
        ? snprintf(line, sizeof(line), "T%08" PRIX32 "%u",
                   msg.identifier, msg.data_length_code)
        : snprintf(line, sizeof(line), "t%03" PRIX32 "%u",
                   msg.identifier, msg.data_length_code);
    // Bound n so the two hex digits and the trailing '\r' always fit: if n
    // ever passed sizeof(line), the sizeof(line) - n below would underflow
    // and line[n++] would land out of bounds. Unreachable while loop()
    // clamps DLC to 8, but the formatter shouldn't lean on that.
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof(line) - 3; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    line[n++] = '\r';
    Serial.write((uint8_t*)line, n);
}

// Single hex digit -> 0..15, or -1 if not a hex character.
static int hexNibble(char c) {
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'a' && c <= 'f') return c - 'a' + 10;
    if (c >= 'A' && c <= 'F') return c - 'A' + 10;
    return -1;
}

#if CAN_TX_ENABLED
// Inject a frame onto can0 (native TWAI). Shared by the SLCAN t/T handler and
// the socketcand channel-0 `< send >` so the two TX paths can't drift. Returns
// true if the driver queued the frame. Only compiled when TX is enabled — in a
// listen-only build there is no code that can reach the bus.
static bool canTransmit0(uint32_t id, bool extd, uint8_t dlc, const uint8_t* data) {
    twai_message_t tx = {};
    tx.identifier       = id;
    tx.extd             = extd ? 1 : 0;
    tx.data_length_code = dlc;
    memcpy(tx.data, data, dlc);
    return twai_transmit(&tx, pdMS_TO_TICKS(10)) == ESP_OK;
}
#endif

void slcanHandleCommand(const char* cmd) {
    switch (cmd[0]) {
        case 'O': slcan_open = true;  Serial.write('\r'); break;
        case 'C': slcan_open = false; Serial.write('\r'); break;
        case 'S': Serial.write('\r'); break;   // speed — fixed at 250k
        case 'V': Serial.print("V1013\r"); break;
        case 'N': Serial.print("NA000\r"); break;
        case 'F': Serial.print("F00\r");   break;
        // Transmit: t<iii><l><dd..> (11-bit) / T<iiiiiiii><l><dd..> (29-bit).
        // Reply CR on success, BELL (\a) on any parse/TX error — the Lawicel
        // convention python-can tolerates. Only functional when built with
        // -DCAN_ALLOW_TX; a listen-only build rejects every frame with BELL.
        case 't':
        case 'T': {
#if !CAN_TX_ENABLED
            Serial.write('\a');   // listen-only build: injection disabled
#else
            if (!slcan_open) { Serial.write('\a'); break; }
            bool extd = (cmd[0] == 'T');
            int idlen = extd ? 8 : 3;
            size_t len = strlen(cmd);
            if (len < (size_t)(1 + idlen + 1)) { Serial.write('\a'); break; }
            bool bad = false;
            uint32_t id = 0;
            for (int i = 0; i < idlen && !bad; i++) {
                int nib = hexNibble(cmd[1 + i]);
                if (nib < 0) bad = true; else id = (id << 4) | (uint32_t)nib;
            }
            int dlc = hexNibble(cmd[1 + idlen]);
            if (bad || dlc < 0 || dlc > 8) { Serial.write('\a'); break; }
            if (len < (size_t)(1 + idlen + 1 + dlc * 2)) { Serial.write('\a'); break; }
            id &= extd ? 0x1FFFFFFFUL : 0x7FFUL;
            uint8_t data[8] = {0};
            const char* dp = cmd + 1 + idlen + 1;
            for (int i = 0; i < dlc && !bad; i++) {
                int hi = hexNibble(dp[i * 2]), lo = hexNibble(dp[i * 2 + 1]);
                if (hi < 0 || lo < 0) bad = true; else data[i] = (uint8_t)((hi << 4) | lo);
            }
            if (bad) { Serial.write('\a'); break; }
            Serial.write(canTransmit0(id, extd, (uint8_t)dlc, data) ? '\r' : '\a');
#endif
            break;
        }
        default:  Serial.write('\r'); break;
    }
}

void slcanPoll() {
    while (Serial.available()) {
        char c = Serial.read();
        if (c == '\r' || c == '\n') {
            if (slcan_len > 0) {
                slcan_buf[slcan_len] = '\0';
                slcanHandleCommand(slcan_buf);
                slcan_len = 0;
            }
        } else if (slcan_len < sizeof(slcan_buf) - 1) {
            slcan_buf[slcan_len++] = c;
        }
    }
}

// ── socketcand ────────────────────────────────────────────────────────────────
// Streams raw CAN frames over WiFi using the socketcand ASCII protocol.
// python-can: interface='socketcand', host='tractor.local', port=28600,
//             channel='can0'
//
// One slot per channel — a client picks its bus with `< open canN >`. On the
// T-2CAN both buses are streamed (can0 = TWAI, can1 = MCP2515); on the
// Feather only can0 is available. Two clients can be connected at once on the
// T-2CAN, one per channel. A new connection that arrives while every slot is
// taken is rejected (the existing clients are kept).

#define SOCKETCAND_PORT 28600
// A client that connects but never completes the open/rawmode handshake would
// pin its slot forever; reclaim the slot after this long.
#define SOCKETCAND_HANDSHAKE_MS 10000

